-- db/sql/v2-add-data.sql

-- заполнение справочников
INSERT INTO subscribers (subscriber_name) VALUES
  ('Иван Иванов Игоревич'),
  ('Пётр Петров Петрович'),
  ('Мария Смирнова Ивановна'),
  ('Александр Александрович Александров'),
  ('Елена Петровна Иванова'),
  ('Дмитрий Сергеевич Петров'),
  ('Ольга Александровна Смирнова');

-- звонки
INSERT INTO callers (subscriber_id, number, rate_id, rate_date, balance) VALUES
  (1, '79001112233', 11, '2025-01-01T00:00:00', 100.00),
  (2, '79002223344', 12, '2025-01-01T00:00:00', 100.00),
  (3, '79003334455', 11, '2025-01-01T00:00:00', 100.00),
  (4, '79004445566', 11, '2025-01-01T00:00:00', 100.00),
  (5, '79005556677', 12, '2025-01-01T00:00:00', 100.00),
  (6, '79006667788', 11, '2025-01-01T00:00:00', 100.00),
  (7, '79872332221', 12, '2025-01-01T00:00:00', 100.00),
  (2, '79008889900', 12, '2025-01-01T00:00:00', 100.00),
  (3, '79009990011', 11, '2025-01-01T00:00:00', 100.00),
  (3, '79001001122', 11, '2025-01-01T00:00:00', 100.00);

-- заполнение типов ресурсов
INSERT INTO resources (resource_name) VALUES
  ('minutes'),
  ('SMS'),
  ('Gb');

-- заполнение ресурсов абонентов
INSERT INTO caller_resources (caller_id, resource_id, current_balance) VALUES
  (1, 1, 0.00),
  (2, 1, 50.00),
  (3, 1, 0.00),
  (4, 1, 0.00),
  (5, 1, 50.00),
  (6, 1, 0.00),
  (7, 1, 50.00),
  (8, 1, 50.00),
  (9, 1, 0.00),
  (10, 1, 0.00);
